#### Terraform working directory 🏠: `demo/demo-account/demo-application/network`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security-group.module.sgs["test-sg-01"].aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "test-sg-01"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "test-sg-01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "test-sg-01"
        }
      + tags_all               = {
          + "Name" = "test-sg-01"
        }
      + vpc_id                 = "vpc-0be71be6cb0093996"
    }

  # module.security-group.module.sg_rules["test-sg-01"].module.egress["allow-outbound"].aws_security_group_rule.cidr["0.0.0.0/0_-1_-1_-1"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - account_vpc_module = {
      - vpc_subnets_map = {
          - VPC-SGP-TST-C-001 = {
              - "172.18.76.0/26"   = "subnet-082bb69d2c09645c4"
              - "172.18.76.128/28" = "subnet-0ad61ab54b7e0b06f"
              - "172.18.76.144/28" = "subnet-0897c9e1b04e2272f"
              - "172.18.76.64/26"  = "subnet-0cf65861d3a972431"
            }
          - VPC-SGP-TST-C-002 = {
              - "172.19.76.0/26"   = "subnet-0c40136d33dcc3148"
              - "172.19.76.128/28" = "subnet-003757ac482101647"
              - "172.19.76.144/28" = "subnet-08eaa89b567a99cc8"
              - "172.19.76.64/26"  = "subnet-049ad56fc113b5df3"
            }
        }
      - vpcs            = {
          - VPC-SGP-TST-C-001 = {
              - azs                                         = [
                  - "ap-southeast-1a",
                  - "ap-southeast-1b",
                ]
              - cgw_arns                                    = []
              - cgw_ids                                     = []
              - default_network_acl_id                      = "acl-05148eb9fa1dba330"
              - default_route_table_id                      = "rtb-010ee002cf5912692"
              - default_security_group_id                   = "sg-033e4644ca8d5401d"
              - default_vpc_arn                             = ""
              - default_vpc_cidr_block                      = ""
              - default_vpc_default_network_acl_id          = ""
              - default_vpc_default_route_table_id          = ""
              - default_vpc_default_security_group_id       = ""
              - default_vpc_enable_dns_hostnames            = ""
              - default_vpc_enable_dns_support              = ""
              - default_vpc_id                              = ""
              - default_vpc_instance_tenancy                = ""
              - default_vpc_main_route_table_id             = ""
              - dhcp_options_id                             = "dopt-0a5b465255f323311"
              - egress_only_internet_gateway_id             = ""
              - elasticache_network_acl_arn                 = ""
              - elasticache_network_acl_id                  = ""
              - elasticache_route_table_association_ids     = []
              - elasticache_route_table_ids                 = []
              - elasticache_subnet_arns                     = []
              - elasticache_subnet_group                    = ""
              - elasticache_subnet_group_name               = ""
              - elasticache_subnets                         = []
              - elasticache_subnets_cidr_blocks             = []
              - elasticache_subnets_ipv6_cidr_blocks        = []
              - igw_arn                                     = ""
              - igw_id                                      = ""
              - intra_network_acl_arn                       = ""
              - intra_network_acl_id                        = ""
              - intra_route_table_association_ids           = [
                  - "rtbassoc-03b4f7a718b47032a",
                  - "rtbassoc-0ee937b0f5604fa06",
                ]
              - intra_route_table_ids                       = [
                  - "rtb-0e38dd8430678398d",
                ]
              - intra_route_table_tags                      = [
                  - {
                      - Name           = "RTB-SGP-TST-PRT-AP01-ALL"
                      - RouteTableType = "intra"
                    },
                ]
              - intra_subnet_arns                           = [
                  - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-082bb69d2c09645c4",
                  - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0cf65861d3a972431",
                ]
              - intra_subnets                               = [
                  - "subnet-082bb69d2c09645c4",
                  - "subnet-0cf65861d3a972431",
                ]
              - intra_subnets_cidr_blocks                   = [
                  - "172.18.76.0/26",
                  - "172.18.76.64/26",
                ]
              - intra_subnets_ipv6_cidr_blocks              = [
                  - "",
                  - "",
                ]
              - name                                        = "VPC-SGP-TST-C-001"
              - nat_ids                                     = []
              - nat_public_ips                              = []
              - natgw_ids                                   = []
              - outpost_network_acl_arn                     = ""
              - outpost_network_acl_id                      = ""
              - outpost_subnet_arns                         = []
              - outpost_subnets                             = []
              - outpost_subnets_cidr_blocks                 = []
              - outpost_subnets_ipv6_cidr_blocks            = []
              - private_ipv6_egress_route_ids               = []
              - private_nat_gateway_route_ids               = []
              - private_network_acl_arn                     = ""
              - private_network_acl_id                      = ""
              - private_route_table_association_ids         = []
              - private_route_table_ids                     = []
              - private_route_table_tags                    = []
              - private_subnet_arns                         = []
              - private_subnets                             = []
              - private_subnets_cidr_blocks                 = []
              - private_subnets_ipv6_cidr_blocks            = []
              - public_internet_gateway_ipv6_route_id       = ""
              - public_internet_gateway_route_id            = ""
              - public_network_acl_arn                      = ""
              - public_network_acl_id                       = ""
              - public_route_table_association_ids          = []
              - public_route_table_ids                      = []
              - public_route_table_tags                     = []
              - public_subnet_arns                          = []
              - public_subnets                              = []
              - public_subnets_cidr_blocks                  = []
              - public_subnets_ipv6_cidr_blocks             = []
              - redshift_network_acl_arn                    = ""
              - redshift_network_acl_id                     = ""
              - redshift_public_route_table_association_ids = []
              - redshift_route_table_association_ids        = []
              - redshift_route_table_ids                    = []
              - redshift_subnet_arns                        = []
              - redshift_subnet_group                       = ""
              - redshift_subnets                            = []
              - redshift_subnets_cidr_blocks                = []
              - redshift_subnets_ipv6_cidr_blocks           = []
              - route_tables                                = {
                  - rtb-0626f3a6300670a82 = {
                      - Name           = "RTB-SGP-TST-PRT-TGW-ALL"
                      - RouteTableType = "tgw"
                    }
                  - rtb-0e38dd8430678398d = {
                      - Name           = "RTB-SGP-TST-PRT-AP01-ALL"
                      - RouteTableType = "intra"
                    }
                }
              - tgw_internet_gateway_route_id               = ""
              - tgw_ipv6_egress_route_id                    = ""
              - tgw_nat_gateway_route_ids                   = []
              - tgw_network_acl_arn                         = "arn:aws:ec2:ap-southeast-1:129980683758:network-acl/acl-08bf76552fe0d31f3"
              - tgw_network_acl_id                          = "acl-08bf76552fe0d31f3"
              - tgw_route_table_association_ids             = [
                  - "rtbassoc-0e4487fb0cbb8779a",
                  - "rtbassoc-0c12f1447498fd3ff",
                ]
              - tgw_route_table_ids                         = [
                  - "rtb-0626f3a6300670a82",
                ]
              - tgw_route_table_tags                        = [
                  - {
                      - Name           = "RTB-SGP-TST-PRT-TGW-ALL"
                      - RouteTableType = "tgw"
                    },
                ]
              - tgw_subnet_arns                             = [
                  - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0ad61ab54b7e0b06f",
                  - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0897c9e1b04e2272f",
                ]
              - tgw_subnets                                 = [
                  - "subnet-0ad61ab54b7e0b06f",
                  - "subnet-0897c9e1b04e2272f",
                ]
              - tgw_subnets_cidr_blocks                     = [
                  - "172.18.76.128/28",
                  - "172.18.76.144/28",
                ]
              - tgw_subnets_ipv6_cidr_blocks                = [
                  - "",
                  - "",
                ]
              - this_customer_gateway                       = {}
              - vgw_arn                                     = ""
              - vgw_id                                      = ""
              - vpc_arn                                     = "arn:aws:ec2:ap-southeast-1:129980683758:vpc/vpc-0be71be6cb0093996"
              - vpc_cidr_block                              = "172.18.76.0/25"
              - vpc_enable_dns_hostnames                    = true
              - vpc_enable_dns_support                      = true
              - vpc_flow_log_cloudwatch_iam_role_arn        = ""
              - vpc_flow_log_destination_arn                = ""
              - vpc_flow_log_destination_type               = "cloud-watch-logs"
              - vpc_flow_log_id                             = ""
              - vpc_id                                      = "vpc-0be71be6cb0093996"
              - vpc_instance_tenancy                        = "default"
              - vpc_ipv6_association_id                     = ""
              - vpc_ipv6_cidr_block                         = ""
              - vpc_main_route_table_id                     = "rtb-010ee002cf5912692"
              - vpc_owner_id                                = "129980683758"
              - vpc_secondary_cidr_blocks                   = [
                  - "172.18.76.128/26",
                ]
            }
          - VPC-SGP-TST-C-002 = {
              - azs                                         = [
                  - "ap-southeast-1a",
                  - "ap-southeast-1b",
                ]
              - cgw_arns                                    = []
              - cgw_ids                                     = []
              - default_network_acl_id                      = "acl-0483344dcf3bab01a"
              - default_route_table_id                      = "rtb-07bb297f2ebd0d699"
              - default_security_group_id                   = "sg-064006d00d655d0e6"
              - default_vpc_arn                             = ""
              - default_vpc_cidr_block                      = ""
              - default_vpc_default_network_acl_id          = ""
              - default_vpc_default_route_table_id          = ""
              - default_vpc_default_security_group_id       = ""
              - default_vpc_enable_dns_hostnames            = ""
              - default_vpc_enable_dns_support              = ""
              - default_vpc_id                              = ""
              - default_vpc_instance_tenancy                = ""
              - default_vpc_main_route_table_id             = ""
              - dhcp_options_id                             = "dopt-0a3ce8be2b96db07b"
              - egress_only_internet_gateway_id             = ""
              - elasticache_network_acl_arn                 = ""
              - elasticache_network_acl_id                  = ""
              - elasticache_route_table_association_ids     = []
              - elasticache_route_table_ids                 = []
              - elasticache_subnet_arns                     = []
              - elasticache_subnet_group                    = ""
              - elasticache_subnet_group_name               = ""
              - elasticache_subnets                         = []
              - elasticache_subnets_cidr_blocks             = []
              - elasticache_subnets_ipv6_cidr_blocks        = []
              - igw_arn                                     = ""
              - igw_id                                      = ""
              - intra_network_acl_arn                       = ""
              - intra_network_acl_id                        = ""
              - intra_route_table_association_ids           = [
                  - "rtbassoc-0b54a3cc43a207b9b",
                  - "rtbassoc-06a2bc079da979ef5",
                ]
              - intra_route_table_ids                       = [
                  - "rtb-0efe8ed37fe73f66c",
                ]
              - intra_route_table_tags                      = [
                  - {
                      - Name           = "RTB-SGP-TST-PRT-AP02-ALL"
                      - RouteTableType = "intra"
                    },
                ]
              - intra_subnet_arns                           = [
                  - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0c40136d33dcc3148",
                  - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-049ad56fc113b5df3",
                ]
              - intra_subnets                               = [
                  - "subnet-0c40136d33dcc3148",
                  - "subnet-049ad56fc113b5df3",
                ]
              - intra_subnets_cidr_blocks                   = [
                  - "172.19.76.0/26",
                  - "172.19.76.64/26",
                ]
              - intra_subnets_ipv6_cidr_blocks              = [
                  - "",
                  - "",
                ]
              - name                                        = "VPC-SGP-TST-C-002"
              - nat_ids                                     = []
              - nat_public_ips                              = []
              - natgw_ids                                   = []
              - outpost_network_acl_arn                     = ""
              - outpost_network_acl_id                      = ""
              - outpost_subnet_arns                         = []
              - outpost_subnets                             = []
              - outpost_subnets_cidr_blocks                 = []
              - outpost_subnets_ipv6_cidr_blocks            = []
              - private_ipv6_egress_route_ids               = []
              - private_nat_gateway_route_ids               = []
              - private_network_acl_arn                     = ""
              - private_network_acl_id                      = ""
              - private_route_table_association_ids         = []
              - private_route_table_ids                     = []
              - private_route_table_tags                    = []
              - private_subnet_arns                         = []
              - private_subnets                             = []
              - private_subnets_cidr_blocks                 = []
              - private_subnets_ipv6_cidr_blocks            = []
              - public_internet_gateway_ipv6_route_id       = ""
              - public_internet_gateway_route_id            = ""
              - public_network_acl_arn                      = ""
              - public_network_acl_id                       = ""
              - public_route_table_association_ids          = []
              - public_route_table_ids                      = []
              - public_route_table_tags                     = []
              - public_subnet_arns                          = []
              - public_subnets                              = []
              - public_subnets_cidr_blocks                  = []
              - public_subnets_ipv6_cidr_blocks             = []
              - redshift_network_acl_arn                    = ""
              - redshift_network_acl_id                     = ""
              - redshift_public_route_table_association_ids = []
              - redshift_route_table_association_ids        = []
              - redshift_route_table_ids                    = []
              - redshift_subnet_arns                        = []
              - redshift_subnet_group                       = ""
              - redshift_subnets                            = []
              - redshift_subnets_cidr_blocks                = []
              - redshift_subnets_ipv6_cidr_blocks           = []
              - route_tables                                = {
                  - rtb-03eb5b5458ee2cfac = {
                      - Name           = "RTB-SGP-TST-02-PRT-TGW-ALL"
                      - RouteTableType = "tgw"
                    }
                  - rtb-0efe8ed37fe73f66c = {
                      - Name           = "RTB-SGP-TST-PRT-AP02-ALL"
                      - RouteTableType = "intra"
                    }
                }
              - tgw_internet_gateway_route_id               = ""
              - tgw_ipv6_egress_route_id                    = ""
              - tgw_nat_gateway_route_ids                   = []
              - tgw_network_acl_arn                         = "arn:aws:ec2:ap-southeast-1:129980683758:network-acl/acl-001e4bdae4c6e20cb"
              - tgw_network_acl_id                          = "acl-001e4bdae4c6e20cb"
              - tgw_route_table_association_ids             = [
                  - "rtbassoc-0e340e9823d5b7af3",
                  - "rtbassoc-023b32d79722cd36a",
                ]
              - tgw_route_table_ids                         = [
                  - "rtb-03eb5b5458ee2cfac",
                ]
              - tgw_route_table_tags                        = [
                  - {
                      - Name           = "RTB-SGP-TST-02-PRT-TGW-ALL"
                      - RouteTableType = "tgw"
                    },
                ]
              - tgw_subnet_arns                             = [
                  - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-003757ac482101647",
                  - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-08eaa89b567a99cc8",
                ]
              - tgw_subnets                                 = [
                  - "subnet-003757ac482101647",
                  - "subnet-08eaa89b567a99cc8",
                ]
              - tgw_subnets_cidr_blocks                     = [
                  - "172.19.76.128/28",
                  - "172.19.76.144/28",
                ]
              - tgw_subnets_ipv6_cidr_blocks                = [
                  - "",
                  - "",
                ]
              - this_customer_gateway                       = {}
              - vgw_arn                                     = ""
              - vgw_id                                      = ""
              - vpc_arn                                     = "arn:aws:ec2:ap-southeast-1:129980683758:vpc/vpc-03ac88ecf04749d2d"
              - vpc_cidr_block                              = "172.19.76.0/25"
              - vpc_enable_dns_hostnames                    = true
              - vpc_enable_dns_support                      = true
              - vpc_flow_log_cloudwatch_iam_role_arn        = ""
              - vpc_flow_log_destination_arn                = ""
              - vpc_flow_log_destination_type               = "cloud-watch-logs"
              - vpc_flow_log_id                             = ""
              - vpc_id                                      = "vpc-03ac88ecf04749d2d"
              - vpc_instance_tenancy                        = "default"
              - vpc_ipv6_association_id                     = ""
              - vpc_ipv6_cidr_block                         = ""
              - vpc_main_route_table_id                     = "rtb-07bb297f2ebd0d699"
              - vpc_owner_id                                = "129980683758"
              - vpc_secondary_cidr_blocks                   = [
                  - "172.19.76.128/26",
                ]
            }
        }
    } -> null

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
